
    import java.util.Scanner;

    public class MyTvPult {
        public static void main(String[] args) {
            String[] channel = {"1-channel", "TNT", "BBC", "Muz TV" , "5-channel", "Fox News", "Disney", "KTRK", "Bloomberg"};
            int index = 0;
            int m = 0;
            while (m == 0) {


                System.out.print(tvOnOff()[1] + myPult() + "Your choice: ");
                String myAnswer = new Scanner(System.in).nextLine();

                if(myAnswer.equalsIgnoreCase("on")){

                    System.out.print(tvOnOff()[0]);

                    String mychoice;
                    int n = 0;
                    do{
                        if (n ==0){
                            System.out.print(myPult() + "\nYour choice: ");
                            n++;
                        }
                        mychoice = new Scanner(System.in).nextLine();
                        if(mychoice.equalsIgnoreCase("on")) System.out.println(myManu() + myPult());

                        if(myPult().contains(mychoice)) {
                            if (mychoice.equalsIgnoreCase("manu")) {
                                System.out.println(myManu() + myPult());
                            }
                            switch (mychoice) {

                                case "next": {
                                    if (mychoice.equalsIgnoreCase("next") && index < tvChannels().length - 1 && index >= 0) {
                                        index++;
                                        System.out.println(tvChannels()[index] + myPult());

                                    } else if (mychoice.equalsIgnoreCase("next") && index == tvChannels().length - 1) {
                                        index = 0;
                                        System.out.println(tvChannels()[index] + myPult());
                                    }
                                    break;
                                }
                                case "back": {
                                    if (mychoice.equalsIgnoreCase("back") && index > 0 && tvChannels().length - 1 >= index) {
                                        System.out.println(tvChannels()[index - 1] + myPult());
                                        index--;
                                    } else if (mychoice.equalsIgnoreCase("back") && index == 0) {
                                        index = tvChannels().length - 1;
                                        System.out.println(tvChannels()[tvChannels().length - 1] + myPult());
                                    }
                                    break;
                                }
                            }
                            String numbers = "123456789";
                            if (numbers.contains(mychoice)) {
                                for (int i = 0; i < tvChannels().length; i++) {
                                    int number = Integer.valueOf(mychoice);
                                    if (number - 1 == i) {
                                        System.out.println(tvChannels()[i] + myPult());
                                        index = i;
                                    }
                                }
                            }
                        }
                        else System.out.println(myManu() + myPult());


                    }  while (!mychoice.equals("off"));

                }
            }

        }

        public static String[] tvChannels(){
            return new String[]{"""
*-------------------------------------------------------------------*
            +*=========================================*+
            ||                               1-channel ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||_________________________________________||
            |___________________________________________|
​
                                   """, """
*-------------------------------------------------------------------*
            +*=========================================*+
            ||                                     TNT ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||_________________________________________||
            |___________________________________________|
​
                                   """, """
*-------------------------------------------------------------------*
            +*=========================================*+
            ||                                     BBC ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||_________________________________________||
            |___________________________________________|
​
                                   """, """
*-------------------------------------------------------------------*
            +*=========================================*+
            ||                                  Muz TV ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||_________________________________________||
            |___________________________________________|
​
                                   """, """
*-------------------------------------------------------------------*
            +*=========================================*+
            ||                               5-channel ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||_________________________________________||
            |___________________________________________|
​
                                   """, """
*-------------------------------------------------------------------*
            +*=========================================*+
            ||                                Fox news ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||_________________________________________||
            |___________________________________________|
​
                                   """, """
*-------------------------------------------------------------------*
            +*=========================================*+
            ||                                  Disney ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||_________________________________________||
            |___________________________________________|
​
                                   """, """
*-------------------------------------------------------------------*
            +*=========================================*+
            ||                                    KTRK ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||_________________________________________||
            |___________________________________________|
​
                                   """, """
*-------------------------------------------------------------------*
            +*=========================================*+
            ||                               Bloomberg ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||                                         ||
            ||_________________________________________||
            |___________________________________________|
​
                                   """};
        }
        public static String myManu(){
            return """
                        *-------------------------------------------------------------------*        
                                    +*=========================================*+
                                    ||      *   *     *     *   *  *   *       ||
                                    ||      ** **    * *    *  **  *   *       ||
                                    ||      * * *   *****   * * *  *   *       || 
                                    ||      *   *  *     *  *   *   ***        ||
                                    || 1- 1-channel 2- TNT        3- BBC       ||
                                    || 4- Muz TV    5- 5-channel  6- Fox News  ||
                                    || 7- Disney    8- KTRK       9- Bloomberg ||
                                    |_________________________________________||
                                    |___________________________________________|
                                                """;
        }

        public static String[] tvOnOff(){
            String[] myTvOnOff = {"""
*-------------------------------------------------------------------*            
            +*=========================================*+
            ||                                         ||
            ||            Welcome to my TV             ||
            ||          We have nine Channel           ||                                           
            ||                                         ||
            ||              Your choice?               ||
            ||                                         ||
            ||                                ->manu   ||
            ||_________________________________________||
            |___________________________________________|
                        
                    """, """
                *-------------------------------------------------------------------*            
                            +*=========================================*+
                            ||                                         ||
                            ||             **   ****  *****            ||
                            ||            *  *  *     *                ||
                            ||            *  *  ***   ***              ||
                            ||            *  *  *     *                ||
                            ||             **   *     *                ||
                            ||      To turn on the TV write "on"       ||
                            ||_________________________________________||
                            |___________________________________________|
                           
                                    """};
            return myTvOnOff;
        }
        public static String myPult(){
            String myPult = ("""
*-------------------------------------------------------------------*
                 TV Пульт
            *-----------------*
            | off          on |
            |                 |
            | (-)  VOL    (+) |
            |     (menu)      |
            | <-back  next -> |
            |    1   2   3    |    
            |    4   5   6    |    
            |    7   8   9    |
            *-----------------*
         
         Tелевизорду куйгузуу учун "on" созун жазыныз.
         Tелевизорду очуруу учун "off" созун жазыныз.
         Менюга кируу учун "menu" созун жазыныз.
         Каалаган каналга отуу учун каналдын номерин жазыныз.
         Кийинки каналга отуу учун "next" созун жазыныз.
         Арткы каналга кайтуу учун "back" созун жазыныз.
*-------------------------------------------------------------------*          
                """);
            return myPult;
        }

    }


